# -*- coding: utf-8 -*-
import os, os.path, cv2

CATALOGUE = {28831199: (19, 'плохо'), 29323263: (32, 'хорошо'), 23063547: (11, 'удовлетворительно'), 33501183: (8, 'хорошо'), 33516503: (5, 'хорошо'),
             29322235: (34, 'хорошо'), 33548799: (8, 'плохо'), 27242493: (26, 'отлично'), 32975835: (27, 'хорошо'), 31436789: (19, 'отлично'),
             29356029: (8, 'отлично'), 33025017: (36, 'отлично'), 33532917: (35, 'отлично'), 33549819: (32, 'плохо'), 32992211: (23, 'хорошо'),
             32976887: (28, 'хорошо'), 28814847: (3, 'плохо'), 33516507: (3, 'хорошо'), 32993267: (22, 'хорошо'), 33501147: (11, 'хорошо'),
             32975859: (30, 'хорошо'), 26734577: (29, 'отлично'), 26718201: (30, 'отлично'), 20951007: (36, 'удовлетворительно'), 31452671: (4, 'плохо'),
             31451615: (28, 'плохо'), 23064539: (13, 'удовлетворительно'), 33517559: (4, 'хорошо'), 25161683: (28, 'удовлетворительно'), 18870227: (29, 'удовлетворительно'),
             33516531: (6, 'хорошо'), 31435263: (12, 'плохо'), 31436283: (36, 'плохо'), 33532383: (24, 'плохо'), 25161695: (4, 'удовлетворительно'),
             33500127: (9, 'хорошо'), 33517523: (7, 'хорошо'), 28815357: (14, 'отлично'), 25160667: (14, 'удовлетворительно'), 30928351: (21, 'плохо'),
             32976863: (25, 'хорошо'), 29322231: (36, 'хорошо'), 23047167: (35, 'удовлетворительно'), 25160703: (2, 'удовлетворительно'), 33024479: (25, 'плохо'),
             32993279: (16, 'хорошо'), 20950015: (34, 'удовлетворительно'), 33009653: (7, 'отлично'), 31436793: (18, 'отлично'), 20967411: (24, 'удовлетворительно'),
             26717663: (23, 'плохо'), 25160691: (26, 'удовлетворительно'), 30911999: (5, 'плохо'), 33008625: (39, 'отлично'), 33025535: (1, 'плохо'),
             27240927: (30, 'плохо'), 18869247: (3, 'удовлетворительно'), 30928885: (21, 'отлично'), 18870239: (5, 'удовлетворительно'), 30928379: (37, 'плохо'),
             29305855: (40, 'хорошо'), 23064575: (1, 'удовлетворительно'), 32976891: (26, 'хорошо'), 33009657: (6, 'отлично'), 33532411: (40, 'плохо'),
             32992251: (18, 'хорошо'), 29356017: (9, 'отлично'), 29322195: (39, 'хорошо'), 23064535: (21, 'удовлетворительно'), 20951035: (40, 'удовлетворительно'),
             29338111: (10, 'плохо'), 25161719: (16, 'удовлетворительно'), 32992223: (17, 'хорошо'), 27258873: (24, 'отлично'), 29355001: (40, 'отлично'),
             20966367: (6, 'удовлетворительно'), 33500151: (12, 'хорошо'), 30912509: (22, 'отлично'), 18852831: (39, 'удовлетворительно'), 33025013: (37, 'отлично'),
             27257343: (14, 'плохо'), 29323227: (35, 'хорошо'), 20967383: (20, 'удовлетворительно'), 33550325: (1, 'отлично'), 28813791: (27, 'плохо'),
             32992247: (20, 'хорошо'), 26718197: (31, 'отлично'), 20966355: (30, 'удовлетворительно'), 23048159: (37, 'удовлетворительно'), 23064563: (25, 'удовлетворительно'),
             23063507: (31, 'удовлетворительно'), 33009119: (17, 'плохо'), 29339641: (10, 'отлично'), 23063519: (7, 'удовлетворительно'), 33008637: (38, 'отлично'),
             30910943: (29, 'плохо'), 27242481: (27, 'отлично'), 27241983: (6, 'плохо'), 33549297: (33, 'отлично'), 26734589: (28, 'отлично'),
             33517535: (1, 'хорошо'), 25161723: (8, 'удовлетворительно'), 18853887: (33, 'удовлетворительно'), 25145343: (32, 'удовлетворительно'), 25144287: (38, 'удовлетворительно'),
             23063543: (19, 'удовлетворительно'), 26734079: (7, 'плохо'), 29323251: (38, 'хорошо'), 30928889: (20, 'отлично'), 33501143: (13, 'хорошо'),
             29339131: (34, 'плохо'), 32975831: (29, 'хорошо'), 33533937: (3, 'отлично'), 33009147: (33, 'плохо'), 28831733: (13, 'отлично'),
             32993243: (19, 'хорошо'), 31453169: (17, 'отлично'), 27258869: (25, 'отлично'), 33532921: (34, 'отлично'), 20966391: (18, 'удовлетворительно'),
             29323223: (37, 'хорошо'), 18869207: (23, 'удовлетворительно'), 20966395: (10, 'удовлетворительно'), 30912497: (23, 'отлично'), 27258335: (22, 'плохо'),
             33500115: (15, 'хорошо'), 32975871: (24, 'хорошо'), 33500155: (10, 'хорошо'), 32993239: (21, 'хорошо'), 33533949: (2, 'отлично'),
             27258363: (38, 'плохо'), 29339103: (18, 'плохо'), 18869211: (15, 'удовлетворительно'), 29322207: (33, 'хорошо'), 26717691: (39, 'плохо'),
             31436255: (20, 'плохо'), 20967387: (12, 'удовлетворительно'), 33517563: (2, 'хорошо'), 33008127: (9, 'плохо'), 33026033: (5, 'отлично'),
             25160663: (22, 'удовлетворительно'), 33549791: (16, 'плохо'), 29355519: (2, 'плохо'), 29354463: (26, 'плохо'), 18869235: (27, 'удовлетворительно'),
             31453181: (16, 'отлично'), 28815345: (15, 'отлично'), 32976851: (31, 'хорошо'), 33501171: (14, 'хорошо'), 26733023: (31, 'плохо'),
             29339637: (11, 'отлично'), 30927359: (13, 'плохо'), 18870263: (17, 'удовлетворительно'), 28831227: (35, 'плохо'), 28831737: (12, 'отлично'),
             33549309: (32, 'отлично'), 18870267: (9, 'удовлетворительно'), 33026045: (4, 'отлично'), 26716671: (15, 'плохо'), 28830207: (11, 'плохо')}


CLASS_TEST = [
    {'name': 'Андрей', 'surname': 'Иванов'},
    {'name': 'Аня', 'surname': 'Петрова'},
    {'name': 'Елизавета', 'surname': 'Белоброва'},
    {'name': 'Анастасия', 'surname': 'Курова'},
    {'name': 'Полина', 'surname': 'Тутова'},
    {'name': 'Артур', 'surname': 'Заплатин'},
    {'name': 'Даниил', 'surname': 'Совин'},
    {'name': 'Артур', 'surname': 'Пирожков'}]

